app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all.reverse
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "author", "img", "description", "prep_time", "serving_size", "calories_count", "star_rating", "created_at", "updated_at", "directions", "ingredients") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    recipe = Recipe.find(params[:id])
    recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "recipes" SET "img" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["img", "https://therecipecritic.com/wp-content/uploads/2019/07/easy_fried_rice-1-500x500.jpg"], ["updated_at", "2020-01-14 19:11:57.541365"], ["id", 1]]